import { useState } from "react";
import man from "../assets/about/man.jpeg";
import about_logo from "../assets/about/about_us_logo.jpeg";
import p1 from "../assets/about/p1.jpeg";
import p2 from "../assets/about/p2.jpeg";
import p3 from "../assets/about/p3.jpeg";
import p4 from "../assets/about/p4.jpeg";
import p5 from "../assets/about/p5.jpeg";
import p6 from "../assets/about/p6.jpeg";
import p7 from "../assets/about/p7.jpeg";
import p8 from "../assets/about/p8.jpeg";
import p9 from "../assets/about/p9.jpeg";
import p10 from "../assets/about/p10.jpeg";
import p11 from "../assets/about/p11.jpeg";
import p12 from "../assets/about/p12.jpeg";
import t1 from "../components/Teachers/images/t-1.jpeg";
import t2 from "../components/Teachers/images/t-2.jpeg";
import "./About.css";

const About = () => {
  const [value, setValue] = useState("1");

  const HandleChange = (e) => {
    console.log(e);
    setValue(e);
  };
  return (
    <div className="about">
      <div className="top_container">

      <div className="top">
        <span></span>
        <div className="right">
          <h1>كلمة ترحيبية من المؤسس</h1>
          <p>
            إن العلم رفيع غيور لا يناله إلا صاحب همة عالية تعال إلينا بهمة عالية
            وغيرة دفاقة سنركبك الخيل ونلزمك الصبر ونعطيك لجام الفرس فأنت فارس
            ميدايين العلم باسم اكاديمية دان البريطانية. أسسنا هذا الصرح لأجل
            تعليم أبناء الشعوب وتأسيس شباب ناجح وبناءه بناء صحيحا يليق برؤية
            العصر.
          </p>
        </div>
        <div className="left">
          <img src={man} alt="" />
        </div>
      </div>
      </div>

      <h1 className="options">
        اكتشف المزيد
        <section>
          <select name="" id="" onChange={(e) => HandleChange(e.target.value)}>
            <option value="1">
              نبذة عن اكاديمية دان البريطانية للعلوم والتكنولوجيا
            </option>
            <option value="2">تعرف علينا</option>
            <option value="3">التخصصات العلمية</option>
            <option value="4">نماذج الشهادات العلمية التدريبية</option>
            <option value="5">السلم الإداري</option>
            <option value="6">دليل الطالب</option>
            <option value="7">عمادة شؤون التعليم</option>
            <option value="8">كليات أكاديمية دان البريطانية</option>
          </select>
        </section>
      </h1>

      <div className="content">
        {value === "1" ? (
          <Option1 />
        ) : value == "2" ? (
          <Option2 />
        ) : value == "3" ? (
          <Option3 />
        ) : value == "4" ? (
          <Option4 />
        ) : value == "5" ? (
          <Option5 />
        ) : value == "6" ? (
          <Option6 />
        ) : value == "7" ? (
          <Option7 />
        ) : (
          <Option8 />
        )}
      </div>
    </div>
  );
};

export default About;

const Option1 = () => {
  return (
    <div className="option3">
      <h3>
        🔷 أكاديمية دان البريطانية للعلوم والتكنولوجيا هي مؤسسة ذات اعتبار
        قانوني في دولة بريطانيا لها سجل تجاري خاص معترف به لدى بريطانيا مصرح
        للمؤسسة ممارسة مجال التعليم العالي والتدريب المهني أونلاين علما بأن لها
        حرما جامعيا في دولة رواندا يفتتح قريبا إن شاء الله .
      </h3>
      <h3>🔷نظام الدراسة :</h3>
      <p>
        تعتمد الجامعة نظام الكورسات والساعات كما أنها تمنح درجة البكالوريوس
        المهني في ثلاث أو اربع سنوات على حسب التخصص وتمنح درجة الدبلوم والماجستير
        والدكتوراه في سنة واحدة فقط .
      </p>

      <h3>التدريب</h3>
      <p>
        تهتم المؤسسة بمجال التدريب اهتماما كبيرا ولديها كلية تهتم بهذا الشأن وهي
        كلية التنمية البشرية والتدريب تقدم هذه الكلية كافة الأنشطة التدريبة
        والمهنية بدورات قصيرة وطويلة كما أن المؤسسة تعتمد مراكز التدريب بمختلف
        جنسياتها وتستخرج لهم رخصة قانونية بريطانية إذا استوفت معايير دان
        البريطانية كما تعتمد أيضا المدربين وتستخرج لهم بطاقات اعتماد باسم
        المؤسسة بحيث يصير المدرب معتمد لدى أكاديمية دان البريطانية للعلوم
        والتكنولوجيا.
      </p>
      <h3>🔷 اعتماداتنا </h3>

      <p>
        يصادق على جميع الشهادات الصادرة من أكاديمية دان البريطانية من سفارة بلد
        الطالب في دولة بريطانيا ومن مزودو خدمات التعليم البريطاني والابوستيل.
      </p>
      <h1 className="teacher-title ">مدربينا المميزين</h1>
      <div className="teacher">
        <div className="image">
          <img src={t1} alt="" />
        </div>
        <h1>د: نيلسون مويسيغي
        </h1>
        <h4>مدير أكاديمية دان البريطانية للعلوم والتكنولوجيا 
        </h4>
        <div className="info">
          <p>
          على مر السنين كرّس نفسه لصقل مهاراته الإدارية في مجال التعليم وإدارة المنظمات غير الحكومية. ينبع نهجه  القيادي من التزامه الراسخ بالتميز والابتكار والشمولية، مما قدم مساهمات قيّمة في كلا القطاعين.
          </p>
          <p>
          يؤمن السيد  نيلسون  بأن الإدارة الفعّالة تتجاوز مجرد إدارة الموارد، بل تتعلق بتهيئة بيئة يزدهر فيها الطلاب والمعلمون على حد سواء. أسلوبه في  القيادة تعاوني ومركّز على الإنسان، مما يضمن شعور جميع أصحاب المصلحة، بمن فيهم المعلمون والطلاب وأولياء الأمور والمجتمع، بالتقدير والتمكين. لقد نجحتد في تطبيق أنظمة تُعطي الأولوية للتميز الأكاديمي مع تعزيز التنمية الشاملة. من خلال الاستفادة من الاستراتيجيات القائمة على البيانات وتعزيز ثقافة التحسين المستمر، تمكنت من الارتقاء بالمعايير المؤسسية وخلق بيئات تعليمية فعّالة وملهمة.
          </p>
          <p>
          في قطاع المنظمات غير الحكومية، لعبت مهاراته الإدارية دورًا محوريًا في قيادة برامج مؤثرة تُعالج قضايا اجتماعية حرجة.
          </p>
          <p>
          كادر أكاديمي  يفخر بشراكاته القوية ، وتعبئة الموارد، وضمان استدامة كل مبادرة ومواءمتها مع احتياجات المجتمعات التي حوله .
          </p>
          <p>
          كما أن الشفافية والمساءلة والشمولية هي ركائز نهجه
          </p>
      <h1>كلمة مدير الأكاديمية عن نفسه
      </h1>
      <p>
      ما يحفزني هو شغفي الحقيقي 
   بإحداث فرق. سواء كنتُ أُرشد المهنيين الشباب، أو أدعو لتغييرات في السياسات، أو أُقود مشاريع واسعة النطاق، فإنني أسترشد بالتزامي بالقيادة الأخلاقية ورغبتي في تمكين الآخرين. أؤمن بأن النجاح الحقيقي يكمن في القدرة على إلهام من حولك ورفع معنوياتهم، ولطالما سعيتُ إلى أن أكون قدوة حسنة، مُظهرًا المرونة والتعاطف، وسعيًا دؤوبًا نحو التميز. باختصار، تميزت مسيرتي الإدارية في التعليم وإدارة المنظمات غير الحكومية بالتفاني في إحداث تغيير هادف ودائم. أنا فخور بالعمل الذي أنجزته، وما زلت ملتزمًا بتوظيف مهاراتي وخبراتي لمواصلة إحداث تأثير إيجابي في العالم. هدفي هو ترك إرث من التغيير والتمكين والأمل، وإلهام الآخرين لتحقيق أقصى إمكاناتهم والمساهمة في مستقبل أفضل للجميع.

      </p>
        </div>
        
      </div>
      <div className="teacher">
        <div className="image second">
          <img src={t2} alt="" />
        </div>
        <h1>موريس إس لانجاما،
        </h1>
       <h4>
       جمهورية ليبيريا، غرب أفريقيا.

       </h4>
        <div className="info">
          <h4>اللغة : الإنجليزية 
          </h4>
          <p>
          المؤهلات الأكاديمية: ماجستير في التربية، ماجستير في العلوم البيئية وإدارة الموارد الطبيعية من رواندا، دبلوم في الكتابة اللغوية والإدارة العامة من جمهورية غانا، بكالوريوس في الاقتصاد واللغة الإنجليزية من جامعة ليبيريا، بالإضافة إلى العديد من الشهادات المهنية في اللغة الإنجليزية، وكتابة مقترحات المنح، والعنف القائم على النوع الاجتماعي، والمخاطر والتخفيف منها، وعلوم الشرطة الأساسية، وغيرها.
          </p>
          <h4>أعمال شغلها :
          </h4>
          <p>
          محاضرًا في جامعة ليبيريا، وكلية التربية في ليكوس، والأكاديمية الوطنية لتدريب الشرطة، وكلية التمريض في فودا.
          </p>
          <p>

والآن يعمل في أكاديمية دان البريطانية للعلوم والتكنولوجيا في كلية الاقتصاد والعلوم السياسية
          </p>
        </div>
        
      </div>
    </div>
  );
};
const Option2 = () => {
  return (
    <div className="option2">
      <div className="image">
        <img src={about_logo} alt="" />
      </div>
      <div className="images_container">

      <h3>
        منذ أن بدأت المؤسسة أنشطتها كان تركز على صنع الإبتسامة الدائمة وزرع
        البذرة الناجحة في نفوس الطلاب
      </h3>
      <div className="box1">
        <img src={p1} alt="" />
        <img src={p4} alt="" />
        <img src={p5} alt="" />
      </div>

      <h3>نختار أماكن الهدوء وذهاب الحزن لنحصد نجاحاً باهرا</h3>
      <div className="box2">
        <img src={p6} alt="" />
        <img src={p7} alt="" />
        <img src={p8} alt="" />
        <img src={p9} alt="" />
        <img src={p10} alt="" />
        <img src={p11} alt="" />
        <img src={p12} alt="" />
      </div>
      </div>

      <h3> لماذا أكاديمية دان</h3>
      <p>لأن المتعلم في دان ستكون كفائته دليلا على شهادته وليس العكس</p>

      <p>
        لأن المتعلم في دان لن يمنح شهادة من أكاديمية دان البريطانية مالم يكن
        كفئا يستحقها
      </p>

      <h3>رسالتنا</h3>
      <p>
        1/نقدم المادة العلمية والأنشطة التدريبية بإخلاص ونجني ثمار ذلك في تغيرات
        مجتمعاتنا الإنسانية على صعيد التطور والتقدم
      </p>
      <p>2/ رفع معدل الكفاءة في مؤسسات العلم والعمل</p>

      <h3>أهدافنا</h3>

      <p>
        خلق استراتيجيات فعالة للتطوير من عملية التعليم والتدريب وفق رؤيتنا
        الجديدة
      </p>
      <h3>نحن نتميز بالآتي</h3>
      <p>
        1/ يخضع المتعلم أو المتدرب عندنا لاختبار عيني نهاية كل برنامج للتأكد من
        تحقيق هدف البرامج.
      </p>

      <p>
        2/ لن يمنح المتعلم أو المتدرب شهادة مالم يجتاز الامتحان بنجاح ويحصل على
        نسبة 65
      </p>

      <p>3/ قبول الشكاوى والمقترحات وتحقيق العدالة ورد مظالم الطلاب .</p>

      <p>4/ القياس والتقويم عبر الاستبيان المقدم باستمرار</p>

      <p>5/ أساليب جديدة ، جودة عالية ،</p>

      <p>6/ منح حقيبة علمية أو تدريبية متكاملة للطالب عندء بدء كل برنامج</p>

      <h3>مبادئنا الموروثة</h3>
      <p>
        نحن نتعلم لنحصل على الملكة في التخصص لنمثل العلم تمثيلا صحيحاً ونزيل
        الجهل ونبني أوطاننا.
      </p>
      <p>
        نسير بالطاقة الإيجابية ، والهمة ، والعزيمة ، والإصرار والصبر كما قال
        الشاعر العربي قديما
      </p>
      <p>لاستسهلن الصعب أو أدرك المنى وما انقادت الآمال إلا لصابر</p>
      <h3> قيمنا الموروثة</h3>
      <ul>
        <li>العمل ضمن فريق</li>

        <li>الأمانة العلمية والنزاهة</li>
        <li>الجودة والكفاءة</li>
        <li>الصدق في نية البذل والعطاء</li>
        <li>الإنسانية</li>
      </ul>
    </div>
  );
};
const Option3 = () => {
  return (
    <div className="option3">
      <h3> بيانات التخصص</h3>

      <p className="course">
        <div>
          فقه العبادات <br />
          رقم الكود dan 0012
          <br />
        </div>

        <div>
          السيرة النبوية <br />
          رقم الكود dan0013
          <br />
        </div>
        <div>
          علوم القرآن <br />
          رقم الكود dan 0014 <br />
        </div>
        <div>
          علوم الحديث <br />
          رقم الكود 0015 <br />
        </div>
        <div>
          القانون <br />
          رقم الكود 0016 <br />
        </div>
        <div>
          هندسة برمجيات <br />
          رقم الكود 0017 <br />
        </div>
        <div>
          هندسة شبكات <br />
          رقم الكود 0018 <br />
        </div>
        <div>
          نظم معلومات <br />
          رقم الكود 0019 <br />
        </div>
        <div>
          الأمن السبراني <br />
          رقم الكود 0020 <br />
        </div>
        <div>
          الذكاء الاصطناعي <br />
          رقم الكود 0021 <br />
        </div>
        <div>
          البرمجة اللغوية العصبية <br />
          رقم الكود 0022 <br />
        </div>
        <div>
          التنمية البشرية <br />
          رقم الكود 0023 <br />
        </div>
        <div>
          الموارد البشرية <br />
          رقم الكود 0024 <br />
        </div>
        <div>
          المحاسبة <br />
          رقم الكود 0025 <br />
        </div>
        <div>
          إدارة الأعمال <br />
          رقم الكود 0026 <br />
        </div>
        <div>
          الاقتصاد والعلوم السياسية <br />
          رقم الكود 0027 <br />
        </div>
        <div>
          بنوك ومصارف <br />
          رقم الكود 0028 <br />
        </div>
        <div>
          تأمين <br />
          رقم الكود 0029 <br />
        </div>
        <div>
          تمريض <br />
          رقم الكود 0030 <br />
        </div>
        <div>
          الصيدلة <br />
          رقم الكود 0031 <br />
        </div>
        <div>
          هندسة ميكانيكية <br />
          رقم الكود 0032 <br />
        </div>
        <div>
          كهرباء عامة <br />
          رقم الكود 0033 <br />
        </div>
        <div>
          تبريد وتكييف <br />
          رقم الكود 0034 <br />
        </div>
        <div>
          كهرباء سيارات <br />
          رقم الكود 0035 <br />
        </div>
        <div>
          علوم كيمياء <br />
          رقم الكود 0036 <br />
        </div>
        <div>
          علوم فيزياء <br />
          رقم الكود 0037 <br />
        </div>
        <div>
          تربية عامة <br />
          رقم الكود 0038 <br />
        </div>
        <div>
          اللغة العربية <br />
          رقم الكود 0039 <br />
        </div>
        <div>
          رياض أطفال <br />
          رقم الكود 0040 <br />
        </div>
        <div>
          تربية بدنية <br />
          رقم الكود 0041 <br />
        </div>
        <div>
          علم النفس <br />
          رقم الكود 0042 <br />
        </div>
        <div>
          علوم الأحياء <br />
          رقم الكود 0043 <br />
        </div>
        <div>
          تربية (فيزياء ، رياضيات) <br />
          رقم الكود 0044 <br />
        </div>
        <div>
          تربية جغرافية تاريخ <br />
          رقم الكود 0045 <br />
        </div>
        <div>
          تربية دراسات إسلامية <br />
          رقم الكود 0046 <br />
        </div>
        <div>
          تربية أحياء كيمياء <br />
          رقم الكود 0047 <br />
        </div>
        <div>
          تربية بدنية <br />
          رقم الكود 0048 <br />
        </div>
        <div>
          علم النفس الإكلينيكى <br />
          رقم الكود 0049 <br />
        </div>
        <div>
          علم النفس الجنائي <br />
          رقم الكود 0050 <br />
        </div>
        <div>
          علم النفس الأسري <br />
          رقم الكود 0054 <br />
        </div>
        <div>
          علم النفس الاجتماعي <br />
          رقم الكود 0055 <br />
        </div>
        <div>
          علم النفس التربوي <br />
          رقم الكود 0056 <br />
        </div>
        <div>
          علم النفس التجريبي <br />
          رقم الكود 0057 <br />
        </div>
        <div>
          علم النفس النمو <br />
          رقم الكود 0058 <br />
        </div>
        <div>
          اللغة الإنجليزية <br />
          رقم الكود 0051 <br />
        </div>
        <div>
          اللغة الفرنسية <br />
          رقم الكود 0052 <br />
        </div>
        <div>
          اللغة التركية <br />
          رقم الكود 0053 <br />
        </div>
      </p>

      <h3>الكليات</h3>
      <p className="course2">
        <div>
          <h3>
            كلية الدراسات العليا ماجستير، دكتوراة، دكتوراة فخرية <br />
          </h3>
        </div>
        <div>
          <h3>
            كلية العلوم الإسلامية وتشمل أربعة تخصصات <br />
          </h3>
          0012-- 00215 <br />
        </div>
        {/* <div>
          <h3>
            كلية القانون <br />
          </h3>
        </div> */}
        <div>
          <h3>
            كلية علوم الكمبيوتر وتشمل خمسة تخصصات <br />
          </h3>
          0017 إلى 0020 <br />
        </div>
        <div>
          <h3>
            كلية الموارد البشرية وتشمل ثلاث تخصصات <br />
          </h3>
          0021---0023 <br />
        </div>
        <div>
          <h3>
            كلية التجارة وتشمل أربعة تخصصات <br />
          </h3>
          0024 إلى 0028 <br />
        </div>
        <div>
          <h3>
            كلية الدراسات الطبية وتشمل تخصصين <br />
          </h3>
          0029 -- 0030 <br />
        </div>
        <div>
          <h3>
            كلية العلوم التطبيقية وتشمل أربعة تخصصات <br />
          </h3>
          0031 إلى 0034 <br />
        </div>
        <div>
          <h3>كلية العلوم وتشمل تخصصين</h3>
          0035 <br />
          0036 <br />
        </div>
        <div>
          <h3>علوم الأحياء</h3>
          0043
        </div>
        <div>
          <h3>
            كلية التربية وتشمل التخصصات الاتية <br />
          </h3>
          0037 تربية أساس <br />
          0039رياض أطفال <br />
          0044 تربية ( فيزياء ، رياضيات) <br />
          0045 تربية ( جغرافيا ، تاريخ ) <br />
          0046 تربية (دراسات إسلامية) <br />
          0047 تربية ( أحياء، كيمياء) <br />
          0048 تربية بدنية <br />
          0054 تربية ( لغة إنجليزية) <br />
        </div>

        <div>
          <h3>
            كلية الطب النفسي <br />
            وتشمل سبع تخصصات <br />
          </h3>
          0042 <br />
          0049 <br />
          0050 <br />
          0054 إلى 0058 <br />
        </div>

        <div>
          <h3>
            كلية اللغات وتشمل اربع تخصصات <br />
          </h3>
          0038 اللغة العربية <br />
          0051 اللغة الإنجليزية <br />
          0052 الفرنسية <br />
          0053 التركية <br />
        </div>
      </p>
    </div>
  );
};
const Option4 = () => {
  return <div></div>;
};
const Option5 = () => {
  return (
    <div>
      <h3>رئيس مجلس الإدارة</h3>
      1/مجلس الشيوخ <br />
      2/ عمداء الكليات <br />
      3/ مسجلو الكليات <br />
    </div>
  );
};
const Option6 = () => {
  const [student_content, setStudent_content] = useState("2");

  return (
    <div className="option6">
      <h3> دليل الطالب</h3>
      <div className="title">
        <h4
          style={
            student_content == "1" ? { borderBottom: "2px solid red" } : {}
          }
          onClick={() => setStudent_content("1")}
        >
          طلب تقديم منحة
        </h4>
        <h4
          style={
            student_content == "2" ? { borderBottom: "2px solid red" } : {}
          }
          onClick={() => setStudent_content("2")}
        >
          طلب تقديم على النفقة الخاصة
        </h4>
      </div>
      <div className="student_content">
        {student_content == "1" ? <Student_Content1 /> : <Student_Content2 />}
      </div>
    </div>
  );
};
const Option7 = () => {
  return (
    <div className="option7">
      <h1>عمادة شؤون التعليم</h1>
      <div>
        <h3>1/ العميد</h3>
        <p>
          وهو رأس العمادة والناطق الرسمي بها مخول له إدارة كافة الأنشطة
          الأكاديمية والمهنية المقدمة باسم الأكاديمية.
          <br />
           هو الشخص الذي يقوم باجازة
          المناهج الدراسية والخطط السنوية للاعوام الدراسية هو الشخص الذي يقوم
          باجازة النتائج السنوية ومنح تصريح إعلانها عبر المواقع الرئيسية.
          <br />
           هو
          الذي يقوم بعقد الاجتماعات السنوية فيما يتعلق بالعام الدراسي وخطة
          إنجاحه وعقدت اجتماعات طارئة اكاديمية ومهنية ان دعت الضرورة.   <br /> هو الشخص
          الذي يقوم بمراجعة المقترحات العلمية والمهنية التي تعمل على تطوير
          المؤسسة ومعالجتها و مناقشته مع الجهات المختصة.   <br /> هو المراقب الدقيق
          للأنشطة المقامة في المؤسسة عبر كَوادرها العلمية والمهنية كما له الحق
          بمعاقبة كل عميد تهاون في ابطال خطته الدراسية وعمل بلا مصداقية وكفاءة
          علمية. له الصلاحية في رفع المقترحات والملاحظات لمدير الجامعات فيما
          يتعلق بانجاح العمل
        </p>

        <h3>شيوخ العمادة</h3>

        <p>1/ العميد</p>
        <p>2/ أمين عام المجلس الأكاديمي</p>
        <p>
          يتبع للعميد وهو الشخص الذي يقوم بكل الأدوار الأكاديمية بمتابعه واشراف
          العميد بمعية أعضاء مجلسه السكرتير والمنسق
        </p>

        <p>3/ منسق المجلس الأكاديمي</p>
        <p>
          هو الشيخ الذي ينسق مهام العمادة ويرامجها وينسق بنود الاجتماعات
          والمخرجات والتوصيات كما انه يسنق الانجازات السنوية والخطط ويحرر الوثائق الرسمية
          الصادرة من الجهات التي هي أعلى منه في الكلية.
        </p>

        <p>4/ السكرتير </p>
        <p>
          هو الشخص الذي يقوم بالمساعدة في مهام المجلس ويقوم بكافة الأعمال
          المكتبية وخدمة البريد
        </p>
      </div>
      <h1>منهجية الدراسة</h1>
      <h3>منهجية الجامعة</h3>
      <p>
        تمنح الجامعة درجة البكالوريوس المهني في ثلاث سنوات بعد اجتياز كافة
        الاختبارات بنجاح والحد الأدنى للنجاح 65٪. وبعض التخصصات الكبييرة في أربع
        سنوات إن اجمالي الكورسات والمواد في العام الدراسي الواحد تتراوح حسب
        التخصصات ما بين 5 إلى 8 مواد. عدد الساعات الدراسية في كل مادة لا تقل عن
        عشرين ساعة . والعام الدراسي الواحد يستغرق ستة أشهر كحد أقصى .
        <br />
        تمنح الجامعة درجة الدبلوم المهني في عام دراسي واحد عدد كورسات البرنامج
        التأهيلي تتراوح ما بين 5 إلى 10 مواد عدد ساعات المادة الواحدة لا تقل عن
        عشرين ساعة . تمنح الجامعة درجة الماجستير المهني في سنة واحدة كحد أدنى
        بعد التأكد من إكمال عدد ساعات الكورسات المقررة ومناقشة الرسالة واجتيازها
        بتقدير عال تتراوح عدد الكورسات ما بين 10 إلى 16 مادة علمية عدد الساعات
        المعتمدة في المادة الواحدة لا يقل عن 15 ساعة تدريسة ثم من بعد ذلك ينعقد
        اختبار يأتي بعد مناقشة رسالة الطالب المطروحة. تمنح الجامعة درجة
        الدكتوراة المهنية في عامين كحد أدنى بعد اكمال عدد ساعات الكورسات المقررة
        ومناقشة الرسالة واجتياز درجة النجاح بتقدير عال عدد الكورسات يتراوح ما
        بين 10 إلى 15 وعدد ساعات الكورس لا تقل عن 15 ساعة
      </p>
      <h3>شروط الالتحاق ببرنامج البكالريوس</h3>
      <ul>
        <li>1/ الشهادة الثانوية مترجمة</li>
        <li>
          2/ معادلة الشهادة الثانوية الصادرة من بلد الطالب في أنظمة القياس
          والجودة في أكاديمية دان البريطانية للعلوم والتكنولوجيا
        </li>
        <li>3/ استيفاء شروط كل تخصص</li>
        <li>4/ إثبات هوية وطنية في بلد الطالب .</li>
      </ul>
      <h3>شروط الالتحاق في برنامج في الماجستير</h3>
      <ul>
        <li>1/ إثبات هوية في بلد الطالب</li>
        <li>2/ شهادة ثانوية مع معادلتها .</li>
        <li>
          3/ شهادة بكالرويس معتمدة وموثقة في بلد الطالب في المجال الذي يرغب أن
          ينال عليه درجة الماجستير .
        </li>
        <li>4/ معادلة شهادة البكالوريوس في أنظمة القياس والجودة</li>
        <li>
          5/ في حال أراد الطالب أن يدرس ماجستير في غير مجاله السابق يتطلب إحضار
          شهادة دبلوم أو دبلوم مهني أو شهادة مؤهل .
        </li>
      </ul>
      <h3>شروط الالتحاق ببرنامج الدكتوارة المهنية</h3>
      <ul>
        <li>1/ إثبات هوية وطنية من بلد الطالب</li>
        <li>2/ شهادة ثانوية</li>
        <li>
          3/ ماجستير في المجال الذي يرغب أن ينال فيه الدكتوراة معتمدة وموثقة في
          بلد الطالب .
        </li>
        <li>
          4/ معادلة شهادة الماجستير في أنظمة القياس والجودة في أكاديمية دان
          البريطانية للعلوم والتكنولوجيا
        </li>
      </ul>

      <p>
        لضمان تحقيق الجودة إن الغالب في الكورسات التطبيق العملي وفي هذه الحالة
        يتحول الطالب إلى مقرات التدريب المعتمدة لدى المؤسسة وهي مراكز صغيرة تؤول
        إدارتها لأكاديمية دان البريطانية للعلوم والتكنولوجيا وهي التي تنفذ فيها
        الكورسات العملية والاختبارات السنوية
      </p>
      <h3>المراكز المعتمدة:</h3>

      <p>
      مركز رواندا العاصمة كيجالي
      <br />مركز السودان امدرمان
      </p>
      <h3>
      المراكز قيد الدراسة
      </h3>
      <p>
        دولة أوغندا العاصمة كمبالا <br />
        ودولة الإمارات محافظة العين <br />
        و في دولة الصومال العاصمة مقديشو <br />
        في دولة تشاد العاصمة انجمينا <br />
        في دولة ليبيريا العاصمة مونروفيا <br />
      </p>

      <h3>ملحوظة مهمة</h3>
      <p>
        في حال لم يستوفي الطالب درجة النجاح في المادة في العام الدراسي يتم إعادة
        الاختبار مرة أخرى وإذا لم ينجح أيضا يجب إعادة العام الدراسي
      </p>
    </div>
  );
};
const Option8 = () => {
  return (
    <div>
      <h1>كليات أكاديمية دان البريطانية:</h1>

      <div>
        <div>
          <h3>أولاً: كلية الدراسات الإسلامية:</h3>
          <p>
            شيوخ الكلية: ـ العميد ـ المسجل ـ المنسق الأكاديمي ـ الطاقم الأكاديمي
          </p>
          <p>التخصصات:</p>
          <p>١/ فقه العبادات</p>
          <p>٢/ السيرة النبوية</p>
          <p>٣/ علوم القرآن</p>
          <p>٤/ علوم الحديث</p>
        </div>

        <div>
          <h3>ثانياً: كلية علوم الكمبيوتر:</h3>
          <p>
            شيوخ الكلية: ـ العميد ـ المسجل ـ المنسق الأكاديمي ـ الطاقم الأكاديمي
          </p>
          <p>التخصصات:</p>
          <p>١/ هندسة البرمجيات</p>
          <p>٢/ هندسة الشبكات</p>
          <p>٣/ نظم المعلومات</p>
          <p>٤/ الأمن السيبراني</p>
          <p>٥/ الذكاء الإصطناعي</p>
        </div>

        <div>
          <h3>ثالثا: كلية التنمية البشرية والتدريب:</h3>
          <p>
            شيوخ الكلية: ـ العميد ـ المسجل ـ المنسق التدريبي ـ الطاقم التدريبي
          </p>
          <p>التخصصات:</p>
          <p>١/ التنمية البشرية</p>
          <p>٢/ الموارد البشرية</p>
          <p>٣/ البرمجة اللغوية العصبية</p>
        </div>

        <div>
          <h3>رابعاً: كلية التجارة:</h3>
          <p>
            شيوخ الكلية: ـ العميد ـ المسجل ـ المنسق الأكاديمي ـ الطاقم الأكاديمي
          </p>
          <p>التخصصات:</p>
          <p>١/ المحاسبة</p>
          <p>٢/ إدارة الأعمال</p>
          <p>٣/ بنوك ومصارف</p>
          <p>٤/ الإقتصاد والعلوم السياسية</p>
          <p>٥/ التأمين</p>
        </div>

        <div>
          <h3>خامساً: كلية الدراسات الطبية:</h3>
          <p>
            شيوخ الكلية: ـ العميد ـ المسجل ـ المنسق الأكاديمي ـ الطاقم الأكاديمي
          </p>
          <p>التخصصات:</p>
          <p>١/ المختبرات الطبية</p>
          <p>٢/ التمريض</p>
          <p>٣/ الصيدلة</p>
        </div>

        <div>
          <h3>سادساً: كلية العلوم التطبيقية:</h3>
          <p>
            شيوخ الكلية: ـ العميد ـ المسجل ـ المنسق الأكاديمي ـ الطاقم الأكاديمي
          </p>
          <p>التخصصات:</p>
          <p>١/ الهندسة الميكانيكية</p>
          <p>٢/ الكهرباء العامة</p>
          <p>٣/ التبريد و التكييف</p>
          <p>٤/ كهرباء السيارات</p>
          <p>٥/ المعادن</p>
          <p>٦/ الهندسة المدنية</p>
          <p>٧/ الهندسة المعمارية</p>
        </div>

        <div>
          <h3>سابعاً: كلية العلوم:</h3>
          <p>
            شيوخ الكلية: ـ العميد ـ المسجل ـ المنسق الأكاديمي ـ الطاقم الأكاديمي
          </p>
          <p>التخصصات:</p>
          <p>١/ الفيزياء</p>
          <p>٢/ الكيمياء</p>
          <p>٣/ الأحياء</p>
        </div>

        <div>
          <h3>ثامناً: كلية التربية:</h3>
          <p>
            شيوخ الكلية: ـ العميد ـ المسجل ـ المنسق الأكاديمي ـ الطاقم الأكاديمي
          </p>
          <p>التخصصات:</p>
          <p>١/ تربية الأساس</p>
          <p>٢/ رياض الأطفال</p>
          <p>٣/ التربية البدنية</p>
          <p>
            ٤/ التربية(فيزياء-رياضيات-جغرافيا-دراسات إسلامية-تاريخ-أحياء-
            كيمياء- اللغة الإنجليزية)
          </p>
        </div>

        <div>
          <h3>تاسعاً: كلية الطب النفسي:</h3>
          <p>
            شيوخ الكلية: ـ العميد ـ المسجل ـ المنسق الأكاديمي ـ الطاقم الأكاديمي
          </p>
          <p>التخصصات:</p>
          <p>١/ علم النفس السريري</p>
          <p>٢/ علم النفس الجنائي</p>
          <p>٣/ علم النفس الأسري</p>
          <p>٤/ علم النفس الإجتماعي</p>
          <p>٥/ علم النفس التربوي</p>
          <p>٦/ علم النفس التجريبي</p>
          <p>٧/ علم النفس النووي</p>
        </div>

        <div>
          <h3>عاشراً: كلية اللغات:</h3>
          <p>
            شيوخ الكلية: ـ العميد ـ المسجل ـ المنسق الأكاديمي ـ الطاقم الأكاديمي
          </p>
          <p>التخصصات:</p>
          <p>١/ اللغة الإنجليزية</p>
          <p>٢/ اللغة الفرنسية</p>
          <p>٣/ اللغة التركية</p>
          <p>٤ اللغة العربية</p>
        </div>

        <div>
          <h3>الحادي عشر: كلية الصحافة والإعلام:</h3>
          <p>
            شيوخ الكلية: ـ العميد ـ المسجل ـ المنسق الأكاديمي ـ الطاقم الأكاديمي
          </p>
          <p>التخصصات:</p>
          <p>١/ الصحافة والنشر</p>
          <p>٢/ الإذاعة والتلفزيون</p>
        </div>

        <div>
          <h3>الثاني عشر: كلية الفلسفة والحضارة:</h3>
          <p>
            شيوخ الكلية: ـ العميد ـ المسجل ـ المنسق الأكاديمي ـ الطاقم الأكاديمي
          </p>
          <p>التخصصات:</p>
          <p>١/ قسم الفلسفة</p>
          <p>٢/ قسم التاريخ والحضارة</p>
        </div>

        <div>
          <h3>الثالث عشر: كلية القانون:</h3>
          <p>
            شيوخ الكلية: ـ العميد ـ المسجل ـ المنسق الأكاديمي ـ الطاقم الأكاديمي
          </p>
          <p>التخصصات:</p>
          <p>١/ القانون العام</p>
          <p>٢/ القانون الخاص</p>
        </div>
      </div>
    </div>
  );
};
const Student_Content1 = () => {
  const [result, setResult] = useState("");
  const array = [];

  const AddToArray = (e) => {
    if (e.target.localName == "div") {
      let value = e.target.innerText;
      value = value.split("\n")[0];

      if (!array.includes(value)) {
        if (array.length < 3) {
          e.target.className = "active";
          array.push(value);
        }
      } else {
        console.log("remove");
        e.target.classList.remove("active");
        array.splice(array.indexOf(value), 1);
      }
    }
  };
  const onSubmit = async (event) => {
    event.preventDefault();
    setResult("Sending....");
    const formData = new FormData(event.target);
    formData.append('بيانات التخصص ', array);


    formData.append("access_key", "151941e4-4d82-48b8-8cd1-a19d7f15c948");

    const response = await fetch("https://api.web3forms.com/submit", {
      method: "POST",
      body: formData
    });

    const data = await response.json();

    if (data.success) {
      setResult("Form Submitted Successfully");
      event.target.reset();
    } else {
      console.log("Error", data);
      setResult(data.message);
    }
  };

  return (
    <div className="student_content1">
      <h1>استمارة البكالوريوس</h1>
      <form onSubmit={onSubmit}>
        <div className="input_name">
          <label htmlFor="">الاسم رباعي : </label>
          <div className="data">
            {/* <input type="text" placeholder="عربي" /> */}
            <input type="text" placeholder="انجليزي" name="name" required/>
          </div>
        </div>
        <div className="input_name">
          <label htmlFor="">الاسم الوالد رباعي : </label>
          <div className="data">
            {/* <input type="text" placeholder="عربي" /> */}
            <input type="text" placeholder="انجليزي" name="father_name" required />
          </div>
        </div>
        <div className="input_name">
          <label htmlFor="">الاسم الوالدة رباعي : </label>
          <div className="data">
            {/* <input type="text" placeholder="عربي" /> */}
            <input type="text" placeholder="انجليزي" name="mother_name" required/>
          </div>
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق اثبات هوية الاب</label>
          <input type="file" />
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق اثبات هوية الام</label>
          <input type="file" />
        </div>
        <div className="input_doc">
          <label htmlFor="">
            ارفق الشهادة الثانوية مترجمة باللغة الانجليزية
          </label>
          <input type="file" />
        </div>
        <h3>البيانات العلمية</h3>
        <div className="input_select">
          <label htmlFor="">المساق</label>
          <select name="المساق" id="" required>
            <option value="ادبي">ادبي</option>
            <option value="علمي">علمي</option>
          </select>
        </div>
        <div className="input_select">
          <label htmlFor="">درجة التأهيل</label>
          <select name="درجة التأهيل" id="" required>
            <option value="58 إلى 60">58 إلى 60</option>
            <option value="60 إلى 100">60 إلى 100</option>
          </select>
        </div>
        <h3>بيانات الشرف والسلوك </h3>
        <div className="input_select">
          <label htmlFor="">
            هل سبق أن قمت بالسرقة أو تسببت في أذية المجتمع بلسانك؟
          </label>
          <div>
            <p>
              نعم
              <input type="radio" name="هل سبق أن قمت بالسرقة " id="" required value="Yes"/>
            </p>
            <p>
              لا
              <input type="radio" name="هل سبق أن قمت بالسرقة " id="" required value="No"/>
            </p>
          </div>
        </div>
        <div className="input_select">
          <label htmlFor="">
            هل سبق أن تشاجرت مع أحد
             الأشخاص وقمت بضربه ظلما ؟
          </label>
          <div>
            <p>
              نعم
              <input type="radio" name="هل سبق أن تشاجرت مع أحد" id="" required value="Yes"/>
            </p>
            <p>
              لا
              <input type="radio" name="هل سبق أن تشاجرت مع أحد" id="" required value="No"/>
            </p>
          </div>
        </div>

        <div className="input_doc">
          <label htmlFor="">ارفق شهادة حسن السير والسلوك </label>
          <input type="file" />
        </div>
        <div className="more_info">
          <input
            type="text"
            placeholder="اسم الجهة المانحة لشهادة السير والسلوك "
            name="اسم الجهة المانحة لشهادة السير والسلوك "
            required
          />

          <input type="text" 
          placeholder="رقم هاتف الواتس " 
          name="رقم هاتف الواتس " 
          required
          />
          <input type="text" 
          placeholder="رقم هاتف الاتصال " 
          name="رقم هاتف الاتصال " 
          required
          />
          <input type="text" 
          placeholder="رابط صفحة الفيس " 
          name="رابط صفحة الفيس " 
          required
          />
          <input type="text" 
          placeholder="البريد الالكتروني" 
          name="البريد الالكتروني" 
          required
          />
        </div>
        <h3>
          بيانات التخصص 

        </h3>
        <div className="course_data">
          <div onClick={(e) => AddToArray(e)}>
            
            فقه العبادات رقم الكود 
            <p>

            dan 0012
            </p>
            </div>
          <div onClick={(e) => AddToArray(e)}>
            السيرة النبوية
            <p>رقم الكود dan0013</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم القرآن
            <p>رقم الكود dan 0014</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم الحديث
            <p>رقم الكود 0015</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            القانون
            <p>رقم الكود 0016</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            هندسة برمجيات
            <p>رقم الكود 0017</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            هندسة شبكات
            <p>رقم الكود 0018</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            نظم معلومات
            <p>رقم الكود 0019</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الأمن السبراني
            <p>رقم الكود 0020</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الذكاء الاصطناعي
            <p>رقم الكود 0021</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            البرمجة اللغوية العصبية
            <p>رقم الكود 0022</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            التنمية البشرية
            <p>رقم الكود 0023</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الموارد البشرية
            <p>رقم الكود 0024</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            المحاسبة
            <p>رقم الكود 0025</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            إدارة الأعمال
            <p>رقم الكود 0026</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الاقتصاد والعلوم السياسية
            <p>رقم الكود 0027</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            بنوك ومصارف
            <p>رقم الكود 0028</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تأمين
            <p>رقم الكود 0029</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تمريض
            <p>رقم الكود 0030</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الصيدلة
            <p>رقم الكود 0031</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            هندسة ميكانيكية
            <p>رقم الكود 0032</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            كهرباء عامة
            <p>رقم الكود 0033</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تبريد وتكييف
            <p>رقم الكود 0034</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            كهرباء سيارات
            <p>رقم الكود 0035</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم كيمياء
            <p>رقم الكود 0036</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم فيزياء
            <p>رقم الكود 0037</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تربية عامة
            <p>رقم الكود 0038</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            اللغة العربية
            <p>رقم الكود 0039</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            رياض أطفال
            <p>رقم الكود 0040</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تربية بدنية
            <p>رقم الكود 0041</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علم النفس
            <p>رقم الكود 0042</p>
          </div>
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق شهادة المؤهل </label>
          <input type="file" />
        </div>
        <div className="more_info">
          <input type="text" 
          placeholder="اكتب رقم التأهيل " 
          name="اكتب رقم التأهيل " 
          required
          />
          <input type="text" 
          placeholder="اسم الجهة المانحة لشهادة المؤهل " 
          name="اسم الجهة المانحة لشهادة المؤهل " 
          required
          />
          <input type="text" 
          placeholder="رقم الهاتف " 
          name="رقم الهاتف " 
          required
          />
          <input type="text" 
          placeholder="البريد الالكتروني " 
          name="البريد الالكتروني " 
          required
          />
          <input type="text" 
          placeholder="رابط الصفحة الرسمية للمؤسسة" 
          name="رابط الصفحة الرسمية للمؤسسة" 
          required
          />
        </div>

        <h3>امتيازات القبول</h3>
        <div className="input_doc">
          <label htmlFor="">ارفق السيرة الذاتية</label>
          <input type="file" />
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق شهادة التطوع </label>
          <input type="file" />
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق شهادة تدريب في مجال العمل الطوعي </label>
          <input type="file" />
        </div>
        <p>بيانات تواصل الجهة المانحة لشهادة التطوع </p>
        <div className="more_info">
          <input type="text" 
          placeholder="اسم الجهة المانحة " 
          name="اسم الجهة المانحة " 
          required
          />
          <input type="text" 
          placeholder="رقم الهاتف "
          name="رقم الهاتف "
          required
           />
          <input type="text" 
          placeholder="البريد الالكتروني " 
          name="البريد الالكتروني " 
          required
          />
          <input type="text" 
          placeholder="رابط الصفحة الرسمية " 
          name="رابط الصفحة الرسمية " 
          required
          />
        </div>
        <button type="submit">Submit</button>
      </form>
      <p>{result}</p>
    </div>
  );
};

const Student_Content2 = () => {
  const [number, setNumber] = useState("1");
  const HandleChangeNumber = (e) => {
    setNumber(e);
  };
  return (
    <div>
      <div className="course_price">
        <div>
          <h3>تخصصات كلية العلوم الإسلامية</h3>
          <h5>السودان ، فلسطين ، جنوب السودان ، سوريا</h5>
          بكالرويس (300 دولار ) <br />
          ماجستير ( 600 دولار ) <br />
          دكتوراه. (800 دولار ) <br />
          <h5>بقية الدول</h5>
          بكالرويس (600 دولار) <br />
          ماجستير ( 1000 دولار) <br />
          دكتوراه ( 1300 دولار ) <br />
        </div>
        <div>
          <h3>كلية القانون</h3>
          <h5>السودان ، جنوب السودان فلسطين ، سوريا</h5>
          بكالرويس 800 دولار <br />
          ماجستير 1000 دولار <br />
          دكتوراه 1300 دولار <br />
          <h5>بقية الدول</h5>
          بكالرويس. 1000 دولار <br />
          ماجستير 1500 دولار <br />
          دكتوراه 2000دولار <br />
        </div>
        <div>
          <h3>كلية الدراسات الطبية</h3>
          <h5>السودان ، جنوب السودان ، سوريا ، فلسطين</h5>
          بكالرويس 1500دولار <br />
          ماجستير 2000لار <br />
          دكتوراه 2500دولار <br />
          <h5>بقية الدول</h5>
          بكالرويس 3000 <br />
          ماجستير 3500 <br />
          دكتوراه 3800 دولار <br />
        </div>
        <div>
          <h3>بقية الكليات</h3>
          <h5>السودان ، جنوب السودان ، فلسطين ، سوريا</h5>
          بكالرويس 900 <br />
          ماجستير 1100 <br />
          دكتوراه 1500 <br />
          <h5>بقية الدول</h5>
          بكالرويس 1800 <br />
          ماجستير 2000 <br />
          دكتوراه 2500 <br />
        </div>
      </div>
      <select onChange={(e) => HandleChangeNumber(e.target.value)}>
        <option value="1">بكالرويس</option>
        <option value="2">ماجستير</option>
        <option value="3">دكتوراة</option>
        <option value="4"> دكتوراة فخرية</option>
      </select>
      <div>
        {number == "1" ? (
          <Student_Content6 />
        ) : number == "2" ? (
          <Student_Content3 />
        ) : number == "3" ? (
          <Student_Content4 />
        ) : (
          <Student_Content5 />
        )}
      </div>
    </div>
  );
};

const Student_Content3 = () => {
  const [result, setResult] = useState("");
  const [bank, setBank] = useState("");
  const [itemValue, setItemValue] = useState("");
  const array = [];
  
  const AddToArray = (e) => {
      if (e.target.localName == "div") {
        let value = e.target.innerText;
        value = value.split("\n")[0];
        if(itemValue !== ""){

          if(itemValue === value){
            e.target.classList.remove("active");
            setItemValue("")
          }

        } else {
          setItemValue(value)
          e.target.className = "active";
        }

      }
    };

  
  const onSubmit = async (event) => {
    event.preventDefault();
    setResult("Sending....");
    const formData = new FormData(event.target);
    formData.append('بيانات التخصص ', itemValue);


    formData.append("access_key", "151941e4-4d82-48b8-8cd1-a19d7f15c948");

    const response = await fetch("https://api.web3forms.com/submit", {
      method: "POST",
      body: formData
    });

    const data = await response.json();

    if (data.success) {
      setResult("Form Submitted Successfully");
      event.target.reset();
    } else {
      console.log("Error", data);
      setResult(data.message);
    }
  };

  return (
    <div className="student_content1">
      <h1>استمارة الماجستير</h1>
      <form onSubmit={onSubmit}>
      <div className="input_name">
          <label htmlFor="">
            الاسم رباعي : 
            </label>
          <div className="data">
            <input type="text" placeholder="انجليزي" name="الاسم رباعي : " required />
          </div>
        </div>
        <div className="input_name">
          <label htmlFor="">
            الاسم الوالد رباعي : 
            </label>
          <div className="data">
            <input type="text" placeholder="انجليزي" name="            الاسم الوالد رباعي : " required/>
          </div>
        </div>
        <div className="input_name">
          <label htmlFor="">
            الاسم الوالدة رباعي : 
            </label>
          <div className="data">
            <input type="text" placeholder="انجليزي" name="            الاسم الوالدة رباعي : " required/>
          </div>
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق اثبات هوية الاب</label>
          <input type="file" />
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق اثبات هوية الام</label>
          <input type="file" />
        </div>

        <div className="input_doc">
          <label htmlFor="">
            ارفق الشهادة الثانوية مترجمة باللغة الانجليزية
          </label>
          <input type="file" />
        </div>
        <div className="input_select">
          <label htmlFor="">
            *هل أنت حاصل على درجة البكالوريوس في التخصص الذي ترغب أن تنال فيه
            درجة الماجستير ؟
          </label>
          <div>
            <p>
              نعم
              <input type="radio" name="
            *هل أنت حاصل على درجة البكالوريوس في التخصص الذي ترغب أن تنال فيه
            درجة الماجستير ؟" id="" value="Yes" required />
            </p>
            <p>
              لا
              <input type="radio" name="
            *هل أنت حاصل على درجة البكالوريوس في التخصص الذي ترغب أن تنال فيه
            درجة الماجستير ؟" id="" value="No" required />
            </p>
          </div>
        </div>
        <div className="input_doc">
          <label htmlFor="">
            ارفق شهادة البكالوريوس مترجمة وموثقة من بلدك{" "}
          </label>
          <input type="file" />
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق معادلة شهادة البكالوريوس</label>
          <input type="file" />
        </div>

        <h3>اختر التخصص من القائمة المنجدلة</h3>
        <div className="course_data">
          <div onClick={(e) => AddToArray(e)}>
            فقه العبادات رقم الكود
            <p>dan 0012</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            السيرة النبوية
            <p>رقم الكود dan0013</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم القرآن
            <p>رقم الكود dan 0014</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم الحديث
            <p>رقم الكود 0015</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            القانون
            <p>رقم الكود 0016</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            هندسة برمجيات
            <p>رقم الكود 0017</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            هندسة شبكات
            <p>رقم الكود 0018</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            نظم معلومات
            <p>رقم الكود 0019</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الأمن السبراني
            <p>رقم الكود 0020</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الذكاء الاصطناعي
            <p>رقم الكود 0021</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            البرمجة اللغوية العصبية
            <p>رقم الكود 0022</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            التنمية البشرية
            <p>رقم الكود 0023</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الموارد البشرية
            <p>رقم الكود 0024</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            المحاسبة
            <p>رقم الكود 0025</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            إدارة الأعمال
            <p>رقم الكود 0026</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الاقتصاد والعلوم السياسية
            <p>رقم الكود 0027</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            بنوك ومصارف
            <p>رقم الكود 0028</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تأمين
            <p>رقم الكود 0029</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تمريض
            <p>رقم الكود 0030</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الصيدلة
            <p>رقم الكود 0031</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            هندسة ميكانيكية
            <p>رقم الكود 0032</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            كهرباء عامة
            <p>رقم الكود 0033</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تبريد وتكييف
            <p>رقم الكود 0034</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            كهرباء سيارات
            <p>رقم الكود 0035</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم كيمياء
            <p>رقم الكود 0036</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم فيزياء
            <p>رقم الكود 0037</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تربية عامة
            <p>رقم الكود 0038</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            اللغة العربية
            <p>رقم الكود 0039</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            رياض أطفال
            <p>رقم الكود 0040</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تربية بدنية
            <p>رقم الكود 0041</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علم النفس
            <p>رقم الكود 0042</p>
          </div>
        </div>
        <h3>
          ما هي طريقة الدفع 
          :</h3>
        <div className="pay">
          <div>
            <input
              type="radio"
              name="ما هي طريقة الدفع "
              id="1"
              required
              onClick={() => setBank("1")}
              value="سداد بنكي "
            />
            <label htmlFor="1">
              سداد بنكي 
              ( بنك دولي )</label>
          </div>
          <div>
            <input
              type="radio"
              name="ما هي طريقة الدفع "
              id="2"
              required
              onClick={() => setBank("2")}
              value="وسترن يونيون"
            />
            <label htmlFor="2">
              وسترن يونيون
              </label>
          </div>
          <div>
            <input
              type="radio"
              name="ما هي طريقة الدفع "
              id="3"
              value="أخرى"
              required
              onClick={() => setBank("3")}
            />
            <label htmlFor="3">أخرى </label>
          </div>
        </div>
        <div className="send">
          {bank == "1" ? (
            <input type="text" 
            placeholder="اكتب الرقم المتسلسل في الايصال" 
            name="الرقم المتسلسل في الايصال" 
            
            />
          ) : bank == "2" ? (
            <input type="text" 
            placeholder="اكتب رقم التحويل الدولي" 
            name="رقم التحويل الدولي" 
            />
          ) : (
            <p>
              تواصل معنا عبر البريد الإلكتروني للبحث عن خيارات أخرى
              <br />
              danacademy20@gmail.com
            </p>
          )}
        </div>
      <button type="submit">Submit</button>
      
      </form>
      <p>{result}</p>
    </div>
  );
};
const Student_Content4 = () => {
  const [result, setResult] = useState("");
  const [bank, setBank] = useState("");
  const [itemValue, setItemValue] = useState("");
  const array = [];
  
    const AddToArray = (e) => {
      if (e.target.localName == "div") {
        let value = e.target.innerText;
        value = value.split("\n")[0];
        if(itemValue !== ""){

          if(itemValue === value){
            e.target.classList.remove("active");
            setItemValue("")
          }

        } else {
          setItemValue(value)
          e.target.className = "active";
        }

      }
    };

  const onSubmit = async (event) => {
    console.log(array)

    event.preventDefault();
    setResult("Sending....");
    const formData = new FormData(event.target);
    formData.append('بيانات التخصص ', itemValue);


    formData.append("access_key", "151941e4-4d82-48b8-8cd1-a19d7f15c948");

    const response = await fetch("https://api.web3forms.com/submit", {
      method: "POST",
      body: formData
    });

    const data = await response.json();

    if (data.success) {
      setResult("Form Submitted Successfully");
      event.target.reset();
    } else {
      console.log("Error", data);
      setResult(data.message);
    }
  };

  return (
    <div className="student_content1">
      <h1>استمارة الدكتوراة</h1>
      <form onSubmit={onSubmit}>
        <div className="input_name">
          <label htmlFor="">
            الاسم رباعي : 
            </label>
          <div className="data">
            <input type="text" placeholder="انجليزي" name="الاسم رباعي : " required />
          </div>
        </div>
        <div className="input_name">
          <label htmlFor="">
            الاسم الوالد رباعي : 
            </label>
          <div className="data">
            <input type="text" placeholder="انجليزي" name="            الاسم الوالد رباعي : " required/>
          </div>
        </div>
        <div className="input_name">
          <label htmlFor="">
            الاسم الوالدة رباعي : 
            </label>
          <div className="data">
            <input type="text" placeholder="انجليزي" name="            الاسم الوالدة رباعي : " required/>
          </div>
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق اثبات هوية الاب</label>
          <input type="file" />
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق اثبات هوية الام</label>
          <input type="file" />
        </div>

        <div className="input_doc">
          <label htmlFor="">
            ارفق الشهادة الثانوية مترجمة باللغة الانجليزية
          </label>
          <input type="file" />
        </div>
        <div className="input_select">
          <label htmlFor="">
            *هل أنت حاصل على درجة الماجستير في التخصص الذي ترغب أن تنال فيه درجة
            الدكتوراة ؟
          </label>
          <div>
            <p>
              نعم
              <input type="radio" name="*هل أنت حاصل على درجة الماجستير في التخصص الذي ترغب أن تنال فيه درجةالدكتوراة ؟" id="" required value="Yes"/>
            </p>
            <p>
              لا
              <input type="radio" name="*هل أنت حاصل على درجة الماجستير في التخصص الذي ترغب أن تنال فيه درجةالدكتوراة ؟" id="" required value="No"/>
            </p>
          </div>
        </div>

        <div className="input_doc">
          <label htmlFor="">ارفق شهادة الماجستير مترجمة وموثقة من بلدك </label>
          <input type="file" />
        </div>

        <h3>اختر التخصص من القائمة المنجدلة</h3>
        <div className="course_data">
          <div onClick={(e) => AddToArray(e)}>
            فقه العبادات رقم الكود
            <p>dan 0012</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            السيرة النبوية
            <p>رقم الكود dan0013</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم القرآن
            <p>رقم الكود dan 0014</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم الحديث
            <p>رقم الكود 0015</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            القانون
            <p>رقم الكود 0016</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            هندسة برمجيات
            <p>رقم الكود 0017</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            هندسة شبكات
            <p>رقم الكود 0018</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            نظم معلومات
            <p>رقم الكود 0019</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الأمن السبراني
            <p>رقم الكود 0020</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الذكاء الاصطناعي
            <p>رقم الكود 0021</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            البرمجة اللغوية العصبية
            <p>رقم الكود 0022</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            التنمية البشرية
            <p>رقم الكود 0023</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الموارد البشرية
            <p>رقم الكود 0024</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            المحاسبة
            <p>رقم الكود 0025</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            إدارة الأعمال
            <p>رقم الكود 0026</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الاقتصاد والعلوم السياسية
            <p>رقم الكود 0027</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            بنوك ومصارف
            <p>رقم الكود 0028</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تأمين
            <p>رقم الكود 0029</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تمريض
            <p>رقم الكود 0030</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الصيدلة
            <p>رقم الكود 0031</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            هندسة ميكانيكية
            <p>رقم الكود 0032</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            كهرباء عامة
            <p>رقم الكود 0033</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تبريد وتكييف
            <p>رقم الكود 0034</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            كهرباء سيارات
            <p>رقم الكود 0035</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم كيمياء
            <p>رقم الكود 0036</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم فيزياء
            <p>رقم الكود 0037</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تربية عامة
            <p>رقم الكود 0038</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            اللغة العربية
            <p>رقم الكود 0039</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            رياض أطفال
            <p>رقم الكود 0040</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تربية بدنية
            <p>رقم الكود 0041</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علم النفس
            <p>رقم الكود 0042</p>
          </div>
        </div>

        <h3>
          ما هي طريقة الدفع
           :</h3>
        <div className="pay">
          <div>
            <input
              type="radio"
              name="ما هي طريقة الدفع"
              id="1"
              onClick={() => setBank("1")}
              value="سداد بنكي "
              required
            />
            <label htmlFor="1">
              سداد بنكي 
              ( بنك دولي )</label>
          </div>
          <div>
            <input
              type="radio"
              name="ما هي طريقة الدفع"
              id="2"
              value="وسترن يونيون"
              onClick={() => setBank("2")}
            />
            <label htmlFor="2">
              وسترن يونيون
              </label>
          </div>
          <div>
            <input
              type="radio"
              name="ما هي طريقة الدفع"
              id="3"
              value="أخرى"
              onClick={() => setBank("3")}
            />
            <label htmlFor="3">أخرى </label>
          </div>
        </div>
        <div className="send">
          {bank == "1" ? (
            <input type="text"
             placeholder="اكتب الرقم المتسلسل في الايصال" 
             name=" الرقم المتسلسل في الايصال" 
            />
          ) : bank == "2" ? (
            <input type="text" 
            placeholder="اكتب رقم التحويل الدولي" 
            name=" رقم التحويل الدولي" 
            />
          ) : (
            <p>
              تواصل معنا عبر البريد الإلكتروني للبحث عن خيارات أخرى
              <br />
              danacademy20@gmail.com
            </p>
          )}
        </div>
        <button type="submit">Submit</button>
      
      </form>
      <p>{result}</p>
    </div>
  );
};
const Student_Content5 = () => {
  const [result, setResult] = useState("");
  const [bank, setBank] = useState("");
  const [array,setArray] = useState([]);

  const AddToArray = (e) => {
    if (e.target.localName == "div") {
      let value = e.target.innerText;
      value = value.split("\n")[0];
      console.log(array.length);

      if (!array.includes(value)) {
        if (array.length < 3) {
          e.target.className = "active";
          setArray([...array,value])

        }
      } else {
        console.log("remove");
        e.target.classList.remove("active");
        const newArray = array
        newArray.splice(array.indexOf(value), 1);
        setArray(newArray)
      }
    }
  };
  const onSubmit = async (event) => {
    event.preventDefault();
    setResult("Sending....");
    const formData = new FormData(event.target);
    formData.append('بيانات التخصص ', array);


    formData.append("access_key", "151941e4-4d82-48b8-8cd1-a19d7f15c948");

    const response = await fetch("https://api.web3forms.com/submit", {
      method: "POST",
      body: formData
    });

    const data = await response.json();

    if (data.success) {
      setResult("Form Submitted Successfully");
      event.target.reset();
    } else {
      console.log("Error", data);
      setResult(data.message);
    }
  };


  return (
    <div className="student_content1">
      <h1>استمارة الدكتوراة الفخرية</h1>
      <form onSubmit={onSubmit}>
      <div className="input_name">
          <label htmlFor="">
            الاسم رباعي : 
            </label>
          <div className="data">
            <input type="text" placeholder="انجليزي" name="الاسم رباعي : " required />
          </div>
        </div>
        <div className="input_name">
          <label htmlFor="">
            الاسم الوالد رباعي : 
            </label>
          <div className="data">
            <input type="text" placeholder="انجليزي" name="            الاسم الوالد رباعي : " required/>
          </div>
        </div>
        <div className="input_name">
          <label htmlFor="">
            الاسم الوالدة رباعي : 
            </label>
          <div className="data">
            <input type="text" placeholder="انجليزي" name="            الاسم الوالدة رباعي : " required/>
          </div>
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق اثبات هوية الاب</label>
          <input type="file" />
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق اثبات هوية الام</label>
          <input type="file" />
        </div>
        <div className="input_doc">
          <label htmlFor="">
            ارفق شهادة البكالوريوس الأكاديمية مترجمة وموثقة
          </label>
          <input type="file" />
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق مستندات أكاديمية أخرى أن وجدت</label>
          <input type="file" />
        </div>
        <h3>بيانات الشرف والسلوك</h3>
        <div className="input_select">
          <label htmlFor="">
            هل سبق أن تشاجرت شجار عنيف مخل بالاخلاق ؟

          </label>
          <div>
            <p>
              نعم
              <input type="radio" name="هل سبق أن تشاجرت شجار عنيف مخل بالاخلاق ؟" id="" required value="Yes"/>
            </p>
            <p>
              لا
              <input type="radio" name="هل سبق أن تشاجرت شجار عنيف مخل بالاخلاق ؟" id="" required value="No"/>
            </p>
          </div>
        </div>
        <div className="input_select">
          <label htmlFor="">
            هل انت واثق من الإجابة وصادق مع نفسك

          </label>
          <div>
            <p>
              نعم
              <input type="radio" name="هل انت واثق من الإجابة وصادق مع نفسك" id="" required value="Yes" />
            </p>
            <p>
              لا
              <input type="radio" name="هل انت واثق من الإجابة وصادق مع نفسك" id="" required value="No" />
            </p>
          </div>
        </div>
        <div className="input_select">
          <label htmlFor="">
            هل انت سيء الاخلاق مع المجتمع ومستمر في سلوكياتك المخلة للوائح الشرف
            ومتنافيه مع مقاصد العلم والمكانة المجتمعية ؟
          </label>
          <div>
            <p>
              نعم
              <input type="radio" name="
            هل انت سيء الاخلاق مع المجتمع ومستمر في سلوكياتك المخلة للوائح الشرف
            ومتنافيه مع مقاصد العلم والمكانة المجتمعية ؟" id="" required value="Yes" />
            </p>
            <p>
              لا
              <input type="radio" name="
            هل انت سيء الاخلاق مع المجتمع ومستمر في سلوكياتك المخلة للوائح الشرف
            ومتنافيه مع مقاصد العلم والمكانة المجتمعية ؟" id="" required value="No" />
            </p>
          </div>
        </div>
        <div className="input_select">
          <label htmlFor="">
            هل انت واثق من الإجابة وصادق مع نفسك
            </label>
          <div>
            <p>
              نعم
              <input type="radio" name="هل انت واثق من الإجابة وصادق مع نفسك" id="" required value="Yes" />
            </p>
            <p>
              لا
              <input type="radio" name="هل انت واثق من الإجابة وصادق مع نفسك" id="" required value="No" />
            </p>
          </div>
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق شهادة حسن السير والسلوك</label>
          <input type="file" />
        </div>
        <div className="more_info">
          <input
            type="text"
            placeholder="اسم الجهة المانحة لشهادة السير والسلوك "
            name="اسم الجهة المانحة لشهادة السير والسلوك "
            required
          />
          <input
            type="text"
            placeholder="بيانات التواصل للجهة المانحة للسير والسلوك"
            name="بيانات التواصل للجهة المانحة للسير والسلوك"
            required
          />
        </div>

        <h3>مالجهات الموصى بك والتي تذكيك
        </h3>
        <p>ثلاث توصيات على الأقل 
        </p>
        <h3>التوصية الأولى 
        </h3>
        <div className="more_info">
          <input
            type="text"
            placeholder=" اسم الجهة أو الشخص"
            name="1 اسم الجهة أو الشخص"
           required 
          />
          <input
            type="text"
            placeholder=" خطاب التوصية أو التزكية"
            name="1 خطاب التوصية أو التزكية"
           required 
          />
        </div>
        <h3>التوصية الثانية 
        </h3>
        <div className="more_info">
          <input
            type="text"
            placeholder=" اسم الجهة أو الشخص"
            name="2 اسم الجهة أو الشخص"
           required 
          />
          <input
            type="text"
            placeholder=" خطاب التوصية أو التزكية"
            name="3 خطاب التوصية أو التزكية"
           required 
          />
        </div>
        <h3>التوصية الثالثة 
        </h3>
        <div className="more_info">
          <input
            type="text"
            placeholder=" اسم الجهة أو الشخص"
            name="3 اسم الجهة أو الشخص"
           required 
          />
          <input
            type="text"
            placeholder=" خطاب التوصية أو التزكية"
            name="3 خطاب التوصية أو التزكية"
           required 
          />
        </div>






        <h3>المجال الذي ترغب أن تنال فيه درجة الدكتوراة الفخرية</h3>
        <p>اختر ثلاث خيارات على الأقل</p>
        <div className="course_data">
          <div onClick={(e) => AddToArray(e)}>
            فقه العبادات رقم الكود
            <p>dan 0012</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            السيرة النبوية
            <p>رقم الكود dan0013</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم القرآن
            <p>رقم الكود dan 0014</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم الحديث
            <p>رقم الكود 0015</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            القانون
            <p>رقم الكود 0016</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            هندسة برمجيات
            <p>رقم الكود 0017</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            هندسة شبكات
            <p>رقم الكود 0018</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            نظم معلومات
            <p>رقم الكود 0019</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الأمن السبراني
            <p>رقم الكود 0020</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الذكاء الاصطناعي
            <p>رقم الكود 0021</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            البرمجة اللغوية العصبية
            <p>رقم الكود 0022</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            التنمية البشرية
            <p>رقم الكود 0023</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الموارد البشرية
            <p>رقم الكود 0024</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            المحاسبة
            <p>رقم الكود 0025</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            إدارة الأعمال
            <p>رقم الكود 0026</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الاقتصاد والعلوم السياسية
            <p>رقم الكود 0027</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            بنوك ومصارف
            <p>رقم الكود 0028</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تأمين
            <p>رقم الكود 0029</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تمريض
            <p>رقم الكود 0030</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الصيدلة
            <p>رقم الكود 0031</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            هندسة ميكانيكية
            <p>رقم الكود 0032</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            كهرباء عامة
            <p>رقم الكود 0033</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تبريد وتكييف
            <p>رقم الكود 0034</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            كهرباء سيارات
            <p>رقم الكود 0035</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم كيمياء
            <p>رقم الكود 0036</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم فيزياء
            <p>رقم الكود 0037</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تربية عامة
            <p>رقم الكود 0038</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            اللغة العربية
            <p>رقم الكود 0039</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            رياض أطفال
            <p>رقم الكود 0040</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تربية بدنية
            <p>رقم الكود 0041</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علم النفس
            <p>رقم الكود 0042</p>
          </div>
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق خطاب الدافع</label>
          <input type="file" />
        </div>

        <div className="input_doc">
          <label htmlFor="">
            ارفق مقالا تعريفيا عن نفسك وضح فيه الإنجازات التي قمت بها على الصعيد
            العلمي والاجتماعي.
            <br />
            انتبه أن لا يقل المقال عن ثلاثين سطرا
          </label>
          <input type="file" />
        </div>

        <h3>
          ما هي طريقة الدفع 
          :</h3>
        <div className="pay">
          <div>
            <input
              type="radio"
              name="ما هي طريقة الدفع "
              id="1"
              required
              onClick={() => setBank("1")}
              value="سداد بنكي "
            />
            <label htmlFor="1">
              سداد بنكي 
              ( بنك دولي )</label>
          </div>
          <div>
            <input
              type="radio"
              name="ما هي طريقة الدفع "
              id="2"
              required
              onClick={() => setBank("2")}
              value="وسترن يونيون"
            />
            <label htmlFor="2">
              وسترن يونيون
              </label>
          </div>
          <div>
            <input
              type="radio"
              name="ما هي طريقة الدفع "
              id="3"
              value="أخرى"
              required
              onClick={() => setBank("3")}
            />
            <label htmlFor="3">أخرى </label>
          </div>
        </div>
        <div className="send">
          {bank == "1" ? (
            <input type="text" 
            placeholder="اكتب الرقم المتسلسل في الايصال" 
            name="الرقم المتسلسل في الايصال" 
            
            />
          ) : bank == "2" ? (
            <input type="text" 
            placeholder="اكتب رقم التحويل الدولي" 
            name="رقم التحويل الدولي" 
            />
          ) : (
            <p>
              تواصل معنا عبر البريد الإلكتروني للبحث عن خيارات أخرى
              <br />
              danacademy20@gmail.com
            </p>
          )}
        </div>
        <button type="submit">Submit</button>
      </form>
      <p>{result}</p>
    </div>
  );
};

const Student_Content6 = () => {
  const [result, setResult] = useState("");
  const [bank, setBank] = useState("");
  const [array,setArray] = useState([]);

  const AddToArray = (e) => {
    if (e.target.localName == "div") {
      let value = e.target.innerText;
      value = value.split("\n")[0];
      console.log(array.length);

      if (!array.includes(value)) {
        if (array.length < 3) {
          e.target.className = "active";
          setArray([...array,value])

        }
      } else {
        console.log("remove");
        e.target.classList.remove("active");
        const newArray = array
        newArray.splice(array.indexOf(value), 1);
        setArray(newArray)
      }
    }
  };

  const onSubmit = async (event) => {
    event.preventDefault();
    setResult("Sending....");
    const formData = new FormData(event.target);
    formData.append('بيانات التخصص ', array);


    formData.append("access_key", "151941e4-4d82-48b8-8cd1-a19d7f15c948");

    const response = await fetch("https://api.web3forms.com/submit", {
      method: "POST",
      body: formData
    });

    const data = await response.json();

    if (data.success) {
      setResult("Form Submitted Successfully");
      event.target.reset();
    } else {
      console.log("Error", data);
      setResult(data.message);
    }
  };


  return (
    <div className="student_content1">
      <h1>استمارة البكالوريوس</h1>
      <form onSubmit={onSubmit}>
      <div className="input_name">
          <label htmlFor="">
            الاسم رباعي : 
            </label>
          <div className="data">
            <input type="text" placeholder="انجليزي" name="الاسم رباعي : " required />
          </div>
        </div>
        <div className="input_name">
          <label htmlFor="">
            الاسم الوالد رباعي : 
            </label>
          <div className="data">
            <input type="text" placeholder="انجليزي" name="            الاسم الوالد رباعي : " required/>
          </div>
        </div>
        <div className="input_name">
          <label htmlFor="">
            الاسم الوالدة رباعي : 
            </label>
          <div className="data">
            <input type="text" placeholder="انجليزي" name="            الاسم الوالدة رباعي : " required/>
          </div>
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق اثبات هوية الاب</label>
          <input type="file" />
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق اثبات هوية الام</label>
          <input type="file" />
        </div>

        <h3>البيانات العلمية</h3>
        <div className="input_select">
          <label htmlFor="">المساق</label>
          <select name="المساق" id="">
            <option value="ادبي">ادبي</option>
            <option value="علمي">علمي</option>
          </select>
        </div>
        <div className="input_select">
          <label htmlFor="">
            درجة التأهيل

          </label>
          <select name="درجة التأهيل" id="">
            <option value="58 إلى 60">58 إلى 60</option>
            <option value="60 إلى 100">60 إلى 100</option>
          </select>
        </div>
        <div className="input_doc">
          <label htmlFor="">
            ارفق الشهادة الثانوية مترجمة باللغة الانجليزية
          </label>
          <input type="file" />
        </div>
        <div className="input_doc">
          <label htmlFor="">ارفق معادلة الشهادة الثانوية مترجمة وموثقة</label>
          <input type="file" />
        </div>

        <h3>بيانات الشرف والسلوك </h3>
        <div className="input_select">
          <label htmlFor="">
            هل سبق أن قمت بالسرقة أو تسببت في أذية المجتمع بلسانك؟
          </label>
          <div>
            <p>
              نعم
              <input type="radio" name="هل سبق أن قمت بالسرقة أو تسببت في أذية المجتمع بلسانك؟" id="" required value="Yes" />
            </p>
            <p>
              لا
              <input type="radio" name="هل سبق أن قمت بالسرقة أو تسببت في أذية المجتمع بلسانك؟" id="" required value="No" />
            </p>
          </div>
        </div>
        <div className="input_select">
          <label htmlFor="">
            هل سبق أن تشاجرت مع أحد الأشخاص وقمت بضربه ظلما ؟
          </label>
          <div>
            <p>
              نعم
              <input type="radio" name="هل سبق أن تشاجرت مع أحد الأشخاص وقمت بضربه ظلما ؟" id="" required value="Yes"/>
            </p>
            <p>
              لا
              <input type="radio" name="هل سبق أن تشاجرت مع أحد الأشخاص وقمت بضربه ظلما ؟" id="" required value="No"/>
            </p>
          </div>
        </div>

        <div className="input_doc">
          <label htmlFor="">ارفق شهادة حسن السير والسلوك </label>
          <input type="file" />
        </div>
        <div className="more_info">
          <input
            type="text"
            placeholder="اسم الجهة المانحة لشهادة السير والسلوك "
            name="اسم الجهة المانحة لشهادة السير والسلوك "
            required
          />
          <input type="text" 
          placeholder="رقم هاتف الواتس " 
          name="رقم هاتف الواتس " 
          required
          />
          <input type="text" 
          placeholder="رقم هاتف الاتصال " 
          name="رقم هاتف الاتصال " 
          required
          />
          <input type="text" 
          placeholder="رابط صفحة الفيس " 
          name="رابط صفحة الفيس " 
          required
          />
          <input type="text" 
          placeholder="البريد الالكتروني" 
          name="البريد الالكتروني" 
          required
          />
        </div>
        <h3> اختر اقرب ثلاثة تخصصات لرغبتك من القائمة المنجدلة</h3>
        <div className="course_data">
          <div onClick={(e) => AddToArray(e)}>
            فقه العبادات رقم الكود
            <p>dan 0012</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            السيرة النبوية
            <p>رقم الكود dan0013</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم القرآن
            <p>رقم الكود dan 0014</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم الحديث
            <p>رقم الكود 0015</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            القانون
            <p>رقم الكود 0016</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            هندسة برمجيات
            <p>رقم الكود 0017</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            هندسة شبكات
            <p>رقم الكود 0018</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            نظم معلومات
            <p>رقم الكود 0019</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الأمن السبراني
            <p>رقم الكود 0020</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الذكاء الاصطناعي
            <p>رقم الكود 0021</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            البرمجة اللغوية العصبية
            <p>رقم الكود 0022</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            التنمية البشرية
            <p>رقم الكود 0023</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الموارد البشرية
            <p>رقم الكود 0024</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            المحاسبة
            <p>رقم الكود 0025</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            إدارة الأعمال
            <p>رقم الكود 0026</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الاقتصاد والعلوم السياسية
            <p>رقم الكود 0027</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            بنوك ومصارف
            <p>رقم الكود 0028</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تأمين
            <p>رقم الكود 0029</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تمريض
            <p>رقم الكود 0030</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            الصيدلة
            <p>رقم الكود 0031</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            هندسة ميكانيكية
            <p>رقم الكود 0032</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            كهرباء عامة
            <p>رقم الكود 0033</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تبريد وتكييف
            <p>رقم الكود 0034</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            كهرباء سيارات
            <p>رقم الكود 0035</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم كيمياء
            <p>رقم الكود 0036</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علوم فيزياء
            <p>رقم الكود 0037</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تربية عامة
            <p>رقم الكود 0038</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            اللغة العربية
            <p>رقم الكود 0039</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            رياض أطفال
            <p>رقم الكود 0040</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            تربية بدنية
            <p>رقم الكود 0041</p>
          </div>
          <div onClick={(e) => AddToArray(e)}>
            علم النفس
            <p>رقم الكود 0042</p>
          </div>
        </div>
        <h3>
          ما هي طريقة الدفع 
          :</h3>
        <div className="pay">
          <div>
            <input
              type="radio"
              name="ما هي طريقة الدفع "
              id="1"
              required
              onClick={() => setBank("1")}
              value="سداد بنكي "
            />
            <label htmlFor="1">
              سداد بنكي 
              ( بنك دولي )</label>
          </div>
          <div>
            <input
              type="radio"
              name="ما هي طريقة الدفع "
              id="2"
              required
              onClick={() => setBank("2")}
              value="وسترن يونيون"
            />
            <label htmlFor="2">
              وسترن يونيون
              </label>
          </div>
          <div>
            <input
              type="radio"
              name="ما هي طريقة الدفع "
              id="3"
              value="أخرى"
              required
              onClick={() => setBank("3")}
            />
            <label htmlFor="3">أخرى </label>
          </div>
        </div>
        <div className="send">
          {bank == "1" ? (
            <input type="text" 
            placeholder="اكتب الرقم المتسلسل في الايصال" 
            name="الرقم المتسلسل في الايصال" 
            
            />
          ) : bank == "2" ? (
            <input type="text" 
            placeholder="اكتب رقم التحويل الدولي" 
            name="رقم التحويل الدولي" 
            />
          ) : (
            <p>
              تواصل معنا عبر البريد الإلكتروني للبحث عن خيارات أخرى
              <br />
              danacademy20@gmail.com
            </p>
          )}
        </div>
        <button type="submit">Submit</button>
      </form>
      <p>{result}</p>
    </div>
  );
};
