import './Blog_Details.css'
const Blog_Details = () => {
  return (
    <div className="blog_details">
      <h1>Blog Post 1</h1>
      <div className="image">
        {/* <img src="" alt="" /> */}
      </div>
    <p>
اولا: دبلومة المعلم الناجح

- عدد ساعات البرنامج التدريبي: 40 ساعة (نصفها للدراسة النظرية والنصف الآخر للتدريب العملي)
- أبرز المفاتيح المشوقة في البرنامج: التركيز على تطبيق ما تم دراسته من محاضرات بصوره دقيقة، ماده علميه مطبوعه وهي عبارة عن كتيب واستمارات عليها توجيهات من قبل المدرب وملاحظات طيله فترة التدريب
- محتويات البرنامج التدريبي: التعليم رسالة لا حرفة، سيرة من سلف من المعلمين الاكفاء، سمات المعلم الناجح، التحضير الجيد والتحضير على الدفتر، لغه الجسد، كيفية استخدام السبورة، اساليب مهمة يجب ان يستخدمها المعلم في الفصل، مهارة التمهيد للدرس، التخلص من الخوف والربكة والاضطراب، كيفية التعامل مع الطالب من حيث السلوك المثالي الوسط المنحرف، كيفيه التعامل مع الطالب من حيث العمر رياض اطفال اساس ثانوي جامعي، نبرات الصوت وتوزيع البصر، معرفة الشخصية واهميتها، تصحيح الكراسات واوراق الامتحانات والكلام عن طريقة التصحيح الخاطئة
- المستهدفون: طلاب وخرجوا الكليات الاتية الالسن التربية الاداب
- مدرب البرنامج: الكوتش الجيلي محمد صالح احمد النور

ثانيا: برنامج زاد الطالب الممتحن

- هو برنامج خاص لطلاب جامعه القران الكريم والعلوم الاسلاميه في دوله السودان
- قام بتاسيس هذا البرنامج رئيس مجلس الاداره بمركز دان الاستاذ الجيل محمد صالح احمد النور
- العام 2016
- الهدف منه مساعده الطلاب اكاديميا ومعنويا
- هذا البرنامج هو عبارة عن محاضرات نهاية كل سمستر ومراجعات مطلوبات الجامعه ومواد التخصص
- - تم تطوير فكرة البرنامج لتشمل  الجامعات في دوله السودان بمختلف الكليات والتخصصات</p>
    </div>
  )
}

export default Blog_Details

