const Senate = () => {
  return (
    <div className="senate">
      <h1>نبذة عن مجلس الشيوخ الأكاديمي</h1>
      <div>
        يتكون مجلس الشيوخ من لجنتين لجنة الشرف والأخلاق واللجنة الأكاديمية
        ويتكون أيضا من أعضاء مجلس السيادة وهم : رئيس مجلس الشيوخ ( رئيس الجامعة
        ) نائب رئيس المجلس ( نائب رئيس الجامعه أو من يختاره الرئيس) الأمين العام
        للمجلس ( عميد الشؤون العلمية) سكرتير المجلس ( عميد الدراسات العليا )
        اعضاء المجلس : عميد كلية التجارة عميد كلية علوم الكمبيوتر عميد كلية
        التنمية البشرية والتدريب مهامهم :
        <div>
          <h4>1/ التأكد من صحة بيانات الطالب لدى الكلية عند منحه الدرجة</h4>
          <h4>
            2/ منح الطالب درجة البكالوريوس أو الدبلوم بعد التأكد من الآتي:
          </h4>
          <ul>
            <li>إكمال عدد الساعات الدراسية</li>
            <li>النجاح بتقدير جيد على الأقل في السنة الأخيرة</li>
            <li>التأكد من أن الطالب خضع لكافة امتحانات الكلية</li>
            <li>
              مراجعة نتائج الطالب وكشوفات درجاته عبر اللجنة الأكاديمية في مجلس
              الشيوخ
            </li>
            <li>
              التأكد من أن الطالب قد أدى ما عليه من التزامات مالية تجاه الكلية
            </li>
            <li>
              التأكد من سلامة سلوكيات الطالب مع زملائه ومعلميه بالكلية عبر لجنة
              الشرف والأخلاق بمجلس الشيوخ
            </li>
          </ul>
          <h4>
            3/ منح الطالب درجة الماجستير أو الدكتوراه بعد التأكد من الآتي:
          </h4>
          إكمال عدد الساعات الدراسية تسليم رسالته العلمية للجنة المشرفة على بحثه
          احضار نسخة إلكترونية وورقية لمجلس الشيوخ الأكاديمي اجتياز مناقشة
          الرسالة بنجاح والحصول على تقدير جيد على الأقل التأكد من أن الطالب أدى
          كل ما عليه من التزامات مالية تجاه كلية الدراسات العليا التأكد من سلامة
          سلوكيات الطالب مع زملائه ومعلميه بالكلية
          <h4>4/ منح درجة الدكتوراة الفخرية بعد التأكد من :</h4>
          أهلية الشخص للشهادة اخلاق الشخص وسمعته في المجتمع احترام وتوقير الشخص
          للمؤسسة إلتزام الشخص بدينه الإسلامي أو احترامه لدين الإسلام إن كان من
          أهل الكتاب
          <h4>
            5/ منح مراكز التدريب اعتمادية دان البريطانية بعد التأكد من استيفاء
            الشروط والمعايير
          </h4>
          وإجازة قرار الاستفادة من صلاحيات الاعتماد والعمل على تنفيذها من قبل
          الجهات المختصة ومخول لها ذلك
          <h4>
            6/ منح المدربون اعتمادية دان البريطانية بعد استيفاء الشروط والمعايير
            وإجازة قرار التمتع بامتيازات الاعتماد والحث على تنفيذها من قبل
            الجهات المختصة ومخول لها ذلك
          </h4>
        </div>
      </div>


      <div>
        <p>
          تمنح الأكاديمية درجة البكالوريوس المهني في فترة لا تقل عن عامين ولا
          تزيد عن ثلاث على حسب التخصص.
        </p>
        <h3>نظام الدراسة</h3>
        <div className="course_system">
          <p>
            1/ يتراوح عدد الكورسات ما بين 6 إلى 8 كورسات في العام الدراسي الواحد
          </p>

          <p>2/عدد الساعات الدراسية لكل كورس يتراوح ما بين 45 إلى 70 ساعة</p>
          <p>3/ تقدم المحاضرات النظرية لكل كورس بواقع 15 ساعة.</p>
          <p>
            4/ يقوم الطالب بكتابة بحث لكل مادة لا تقل عدد الصفحات عن عشرين صفحة.
          </p>

          <p>5/ يتخلل البرنامج الدراسي كورسات تطبيقية</p>

          <p>6/ ينتهي العام الدراسي بامتحانات ومناقشة لبحوث الكورسات</p>

          <p>
            7/يتم منح الطالب درجة البكالوريوس المهني بعد اجتياز كافة الامتحانات
            ومناقشة البحوث وكتابة بحث التخرج.
          </p>
        </div>
      </div>

    </div>
  );
};

export default Senate;
